Revit 2024 API
CurtainGridSet.Insert Method
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public virtual bool Insert(
	CurtainGrid item
)
Visual Basic
Public Overridable Function Insert ( _
	item As CurtainGrid _
) As Boolean
Visual C++
public:
virtual bool Insert(
	CurtainGrid^ item
)
Parameters
item
Type: Autodesk.Revit.DB.CurtainGrid
See Also
CurtainGridSet Class
Autodesk.Revit.DB Namespace